app/controllers/api/routes_controller.rb

SELECT "routes".* FROM "routes" WHERE "routes"."user_id" IS NULL
---
    def index
        @routes = Route.where(user_id: params[:user_id])

INSERT INTO "routes" ("user_id", "route_name", "route_data", "distance", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        @route = Route.new(route_params)
        @route.user_id = current_user.id
        if @route.save