app/controllers/api/routes_controller.rb

    def index
        @routes = Route.all()
---
SELECT "routes".* FROM "routes"