app/controllers/api/workouts_controller.rb

    def index
        @workouts = Workout.all()
---
SELECT "workouts".* FROM "workouts"

    def create
        @workout = Workout.new(workout_params)
        @workout.user_id = current_user.id
        if @workout.save
---
INSERT INTO "workouts" ("user_id", "route_id", "workout_type", "duration", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["route_id", 2], ["workout_type", "hike"], ["duration", 4214], ["created_at", "2021-05-25 17:42:31.604007"], ["updated_at", "2021-05-25 17:42:31.604007"]]

    def destroy
        @workout = Workout.find_by(id: params[:id])
        @workout.destroy
---
SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "workouts" WHERE "workouts"."id" = $1  [["id", 19]]